fireFoam/testBatteryFireFOAM/1DpyrolysisTest/0/U
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           volVectorField;
    object          U;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    outlet         
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    } 

    ground          
    {
        type            fixedValue;
        value           $internalField;
    }

    side          
    {
        type            pressureInletOutletVelocity;
	phi		phi;
        value           $internalField;
    }

    frontAndBack
    {
        type            empty;
    }

    region0_to_panelRegion_panel
    {
        type            flowRateInletVelocityCoupled;
        phi             phi;
        //neigPhi         phiGas;
        nbrPhi         phiGas;
        rho             rho;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
