fireFoam/testBatteryFireFOAM/1DpyrolysisTest/system/panelRegion/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    T
    {
        solver          PCG;
        preconditioner  DIC;
        //tolerance       1e-6;
        tolerance       1e-12;
        relTol          0;
/*
        solver           smoothSolver;// PCG;
        smoother         GaussSeidel;
        preconditioner   DIC;
        tolerance        1e-06;
        relTol           0.1;
        //relTol           0.;
*/
    }

    "Yi"
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-06;
        relTol          0;
    }

    "rho|rhot"
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       0;
        relTol          0;
    };

}

SIMPLE
{
    nNonOrthCorr    0;
}

relaxationFactors
{
//    T           0.7;
}

// ************************************************************************* //
