fireFoam/testBatteryFireFOAM/1DpyrolysisTest/system/makeFaceSet.setSet
faceSet coupledPatch new patchToFace coupledPatch
faceZoneSet panel new setToFaceZone coupledPatch

