fireFoam/testBatteryFireFOAM/1DpyrolysisTest/Allrun.pre
#!/bin/sh

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

runApplication blockMesh

runApplication setSet -batch system/makeFaceSet.setSet

runApplication extrudeToRegionMesh17x -overwrite


# -----------------------------------------------------------------------------
